notas/Complejidad/notas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 Thu 15:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Complejidad Computacional</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Complejidad Computacional</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org19bda56">Rubros</a></li>
<li><a href="#org5498af1">Notas</a>
<ul>
<li><a href="#org630810e">15 / 08 / 23</a>
<ul>
<li><a href="#org93ad721">Contexto</a></li>
<li><a href="#org9934440">Preguntas</a></li>
</ul>
</li>
<li><a href="#orgc229842">16 / 08 / 23</a>
<ul>
<li><a href="#org5fadacd">Análisis del peor caso</a></li>
<li><a href="#org2917f01">Análisis del mejor caso</a></li>
<li><a href="#orgf20d4ed">Tiempo de ejecución</a></li>
<li><a href="#orgcd86d11">O - grande</a></li>
<li><a href="#org4e066d2">Omega grande</a></li>
<li><a href="#org6eb5df5">Theta grante</a></li>
<li><a href="#org135313e">Función de complejidad</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org488d828">Bibliografia</a></li>
</ul>
</div>
</div>

<div id="outline-container-org19bda56" class="outline-2">
<h2 id="org19bda56">Rubros</h2>
</div>

<div id="outline-container-org5498af1" class="outline-2">
<h2 id="org5498af1">Notas</h2>
<div class="outline-text-2" id="text-org5498af1">
</div>
<div id="outline-container-org630810e" class="outline-3">
<h3 id="org630810e">15 / 08 / 23</h3>
<div class="outline-text-3" id="text-org630810e">
</div>
<div id="outline-container-org93ad721" class="outline-4">
<h4 id="org93ad721">Contexto</h4>
<div class="outline-text-4" id="text-org93ad721">
<p>
¿Cuáles son las capacidades fundamentales y limitaciones de las
compuitadoras?
</p>

<ul class="org-ul">
<li>Teoría de Autómatas

<ul class="org-ul">
<li>¿Cómo podemos hacer cómputo?</li>
</ul></li>

<li>Teoría de Computabilidad

<ul class="org-ul">
<li>¿Qué podemos computar?</li>
</ul></li>

<li>Teoría de la Complejidad

<ul class="org-ul">
<li>¿Qué es lo que hace a algunos problemas compuacionalmente
difíciles y otros fáciles?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9934440" class="outline-4">
<h4 id="org9934440">Preguntas</h4>
<div class="outline-text-4" id="text-org9934440">
<ul class="org-ul">
<li>¿Qué es un problema?</li>

<li>¿Qué es un algoritmo?</li>

<li>¿A qué nos referimos con un Algoritmo eficiente?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc229842" class="outline-3">
<h3 id="orgc229842">16 / 08 / 23</h3>
<div class="outline-text-3" id="text-orgc229842">
</div>
<div id="outline-container-org5fadacd" class="outline-4">
<h4 id="org5fadacd">Análisis del peor caso</h4>
<div class="outline-text-4" id="text-org5fadacd">
<p>
El peor caso es el máximo número de operaciones elementales del
algoritmo sobre cualquier ejemplar de tamaño n. Este análisis
proporciona una cota superior sobre ele tiempo de ejecución y
garantiza la eficiencia o no del algoritmo. El peor caso puede
ocurrir pocas veces.
</p>
</div>
</div>

<div id="outline-container-org2917f01" class="outline-4">
<h4 id="org2917f01">Análisis del mejor caso</h4>
<div class="outline-text-4" id="text-org2917f01">
<p>
El mínimo número de operaciones elementales de un algoritmo para
cualquier ejemplar de tamaño n es demasiado <b>optimista</b> y no
garantiza eficiencia, solo da una <b>cota inferior</b> sobre el tiempo de
ejecución.
</p>
</div>
</div>

<div id="outline-container-orgf20d4ed" class="outline-4">
<h4 id="orgf20d4ed">Tiempo de ejecución</h4>
<div class="outline-text-4" id="text-orgf20d4ed">
<p>
Depende de cuanto tiempo le tome a una computadora ejecutar las
líneas de código del algoritmo:
</p>

<ul class="org-ul">
<li>¿Cuánto tiempo se tarda el algoritmo en términos del tamaño de
su entrada?</li>

<li>¿Qué tan rápido crece una función con el tamaño de la entrada?
(tasa de crecimiento)</li>
</ul>


<p>
Cuando descartamos los coeficientes constantes y los término menos
significativos usamos <i>notación asintótica</i>. Veremos 3 formas:
notación \(\Theta\) grande, notación $O$-grande y notacion \(\Omega\)
-grande.
</p>
</div>
</div>

<div id="outline-container-orgcd86d11" class="outline-4">
<h4 id="orgcd86d11">O - grande</h4>
<div class="outline-text-4" id="text-orgcd86d11">
<p>
Si un tiempo de ejecución es \(O(f(n))\). Entonces para una \(n\)
suficentemente grande el tiempo de ejecución es \(k\cdot f(n)\).
Usamos esta notación para cotas asintóticas superiores
(acota por arriba, a lo más).
</p>
</div>
</div>

<div id="outline-container-org4e066d2" class="outline-4">
<h4 id="org4e066d2">Omega grande</h4>
<div class="outline-text-4" id="text-org4e066d2">
<p>
(acota por abajo, a lo menos)
</p>
</div>
</div>

<div id="outline-container-org6eb5df5" class="outline-4">
<h4 id="org6eb5df5">Theta grante</h4>
<div class="outline-text-4" id="text-org6eb5df5">
<p>
(Cota asintótica ajustada)
</p>
</div>
</div>

<div id="outline-container-org135313e" class="outline-4">
<h4 id="org135313e">Función de complejidad</h4>
<div class="outline-text-4" id="text-org135313e">
<p>
<b>Definición</b>: Cualquier función que representa el tiempo de
ejecución de un algoritmo se conoce como función de complejidad.
</p>

<p>
\(C=\lim_{n\to\infty}\frac{f(n)}{g(n)}\)
</p>

<p>
\(C<\infty\) -&gt; \(f(n)=O(g(n))\)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org488d828" class="outline-2">
<h2 id="org488d828">Bibliografia</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2023-08-17 Thu 15:56</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>